# Регистры для целочисленных аргументов (первые 6)
ARG_REGS = ['rdi', 'rsi', 'rdx', 'rcx', 'r8', 'r9']
RET_REG = 'rax'

# Регистры, которые могут использоваться для временных переменных (caller-saved)
# Исключаем rdi, rsi, rdx, rcx, r8, r9, так как они могут быть заняты параметрами,
# но в LSRA мы будем их учитывать отдельно. Для простоты возьмём широкий пул.
TEMP_REGS = ['rax', 'rcx', 'rdx', 'rsi', 'rdi', 'r8', 'r9', 'r10', 'r11']

# Системные вызовы Linux x86-64
SYS_WRITE = 1
SYS_EXIT = 60

# Номера файловых дескрипторов
STDOUT = 1

# Размеры
WORD_SIZE = 8  # байт